// Ikura.cs 
//
// @idev Unity2017.1.0f3 / MonoDevelop5.9.6
// @auth FCEI.No-Va
// @date 2017/08/20
//
// Copyright (C) 2017 FlyteCatEmotion Inc.
// All Rights Reserved.
//------------------------------------------------------------------------------------------------------------------------
using System.Collections;
using System.Collections.Generic;
using UnityEngine;

//----------------------------------------------------------------------------------------------------
// いくらの制御 
//----------------------------------------------------------------------------------------------------
public class Ikura : MonoBehaviour
{
	//--------------------------------------------------------------------------------
	// メンバ変数 
	//--------------------------------------------------------------------------------
	Transform _t;

	float vx;
	float vy;

	[SerializeField]SpriteRenderer sprite;



	//--------------------------------------------------------------------------------
	// コンストラクタ  
	//--------------------------------------------------------------------------------
	void Awake ()
	{
		_t = this.gameObject.transform;
	}



	//--------------------------------------------------------------------------------
	// セットアップ  
	//--------------------------------------------------------------------------------
	public void Setup (float x, float y, float vx, float vy)
	{
		_t.position = new Vector3(x, y, 0);

		this.vx = vx;
		this.vy = vy;
	}



	//--------------------------------------------------------------------------------
	// 更新　 
	//--------------------------------------------------------------------------------
	void Update ()
	{
		_t.position = new Vector3(
			_t.position.x + vx,
			_t.position.y + vy,
			_t.position.z
		);

		vx = vx * 0.8f;
		vy = vy * 0.8f;

		sprite.color = new Color(1, 1, 1, Mathf.Min(1, Mathf.Abs(vx)));

		if(Mathf.Abs(vx) < 0.01f){
			GameObject.Destroy(this.gameObject);
		}
	}
}