// GoalSalmon.cs 
//
// @idev Unity2017.1.0f3 / MonoDevelop5.9.6
// @auth FCEI.No-Va
// @date 2017/08/20
//
// Copyright (C) 2017 FlyteCatEmotion Inc.
// All Rights Reserved.
//------------------------------------------------------------------------------------------------------------------------
using System.Collections;
using System.Collections.Generic;
using UnityEngine;

//----------------------------------------------------------------------------------------------------
// ゴールのしゃけの動き 
//----------------------------------------------------------------------------------------------------
public class GoalSalmon : MonoBehaviour
{
	//--------------------------------------------------------------------------------
	// メンバ変数  
	//--------------------------------------------------------------------------------
	[SerializeField]SpriteRenderer sprite;



	//--------------------------------------------------------------------------------
	// 更新 
	//--------------------------------------------------------------------------------
	IEnumerator Start ()
	{
		while(true){
			sprite.flipX  = (Random.Range(0, 2) == 0);
			yield return new WaitForSeconds(0.1f);
		}
	}



	//--------------------------------------------------------------------------------
	// 値セット 
	//--------------------------------------------------------------------------------
	[ContextMenu("EXEC_SetInspector")]
	void SetInspector ()
	{
		sprite  = this.gameObject.GetComponent<SpriteRenderer>();
	}
}
