// FX.cs 
//
// @idev Unity2017.1.0f3 / MonoDevelop5.9.6
// @auth FCEI.No-Va
// @date 2017/08/20
//
// Copyright (C) 2017 FlyteCatEmotion Inc.
// All Rights Reserved.
//------------------------------------------------------------------------------------------------------------------------
using System.Collections;
using System.Collections.Generic;
using UnityEngine;

//----------------------------------------------------------------------------------------------------
// エフェクト管理  
//----------------------------------------------------------------------------------------------------
public class FX : MonoBehaviour
{
	//--------------------------------------------------------------------------------
	// メンバ変数 
	//--------------------------------------------------------------------------------
	Transform _t;		// 高速化 
	Transform transCam;	// カメラの位置を保持しておく 
	float     lifeTime;	// 表示されている時間(0は無限) 

	//--------------------------------------------------------------------------------
	// コンストラクタ 
	//--------------------------------------------------------------------------------
	void Awake ()
	{
		_t = this.gameObject.transform;
	}

	//--------------------------------------------------------------------------------
	// セットアップ 
	//--------------------------------------------------------------------------------
	public void Setup (Transform transCam, float x, float y, float lifeTime=0)
	{
		this.transCam = transCam;
		this.lifeTime = lifeTime;

		_t.position = new Vector3(x, y, 0);
	}

	//--------------------------------------------------------------------------------
	// 更新 
	//--------------------------------------------------------------------------------
	void Update ()
	{
		if(lifeTime > 0){
			lifeTime -= Time.deltaTime;
			if(lifeTime <= 0){
				GameObject.Destroy(this.gameObject);
			}
		}

		if(transCam.position.y > _t.position.y+240+32){
			GameObject.Destroy(this.gameObject);
		}
	}
}
